Repository: quanuanc/Counta
Catalog: Counta/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# about.title
source: 关于
en: About

# accountDetail.currentBalance
source: 当前余额
en: Current Balance

# accountDetail.fullName
source: 完整名称
en: Full Name

# accountDetail.noRelatedTransactions
source: 暂无相关交易
en: No related transactions

# accountDetail.section.accountInfo
source: 账户信息
en: Account Info

# accountDetail.section.balance
source: 余额
en: Balance

# accountDetail.section.relatedTransactions
source: 相关交易
en: Related Transactions

# accountDetail.type
source: 类型
en: Type

# accountType.assets
source: 资产
en: Assets

# accountType.equity
source: 权益
en: Equity

# accountType.expenses
source: 支出
en: Expenses

# accountType.income
source: 收入
en: Income

# accountType.liabilities
source: 负债
en: Liabilities

# balanceSheet.assets
source: 资产
en: Assets

# balanceSheet.empty.title
source: 暂无资产负债表数据
en: No balance sheet data

# balanceSheet.equity
source: 权益
en: Equity

# balanceSheet.liabilities
source: 负债
en: Liabilities

# balanceSheet.netWorth
source: 净资产
en: Net Worth

# common.checkFavaSettings
source: 请检查 Fava 连接设置
en: Check your Fava connection settings

# common.connecting
source: 连接中...
en: Connecting...

# currencyDisplayMode.code.item
source: 缩写 (USD)
en: Code (USD)

# currencyDisplayMode.code.title
source: 缩写
en: Code

# currencyDisplayMode.symbol.item
source: 符号 ($)
en: Symbol ($)

# currencyDisplayMode.symbol.title
source: 符号
en: Symbol

# currencySettings.footer.uncommonCurrencySymbolNote
source: 当货币没有常见符号时，将使用通用货币符号 ¤。
en: When a currency has no common symbol, the generic currency symbol ¤ will be used.

# currencySettings.section.display
source: 显示
en: Display

# currencySettings.title
source: 货币设置
en: Currency Settings

# error.fava.authFailed
source: 认证失败，请检查用户名和密码
en: Authentication failed. Please check username and password.

# error.fava.decoding.accountDetail
source: 无法解析账户明细数据
en: Unable to parse account detail data.

# error.fava.decoding.balanceSheet
source: 无法解析资产负债表数据
en: Unable to parse balance sheet data.

# error.fava.decoding.incomeStatement
source: 无法解析损益表数据
en: Unable to parse income statement data.

# error.fava.decoding.journal
source: 无法解析日记账数据
en: Unable to parse journal data.

# error.fava.httpStatus
source: 服务器返回错误（%lld）
en: Server returned an error (%lld).

# error.fava.invalidBaseURL
source: Fava 地址无效，请检查设置
en: Invalid Fava URL. Please check Settings.

# error.fava.invalidResponse
source: 服务器响应无效，请稍后重试
en: Invalid server response. Please try again later.

# error.fava.missingBaseURL
source: 请先在设置中配置 Fava 地址
en: Please configure the Fava URL in Settings first.

# error.fava.requestFailed
source: 网络请求失败：%@
en: Network request failed: %@.

# error.journal.invalidPage
source: 页码无效，请稍后重试
en: Invalid page number. Please try again later.

# error.journal.noMoreData
source: 暂无更多日记账数据
en: No more journal data.

# error.keychain.unhandledStatus
source: Keychain 错误：%lld
en: Keychain error: %lld

# error.onboarding.invalidURLPrefix
source: 请输入有效的链接（以 http 或 https 开头）
en: Please enter a valid URL (starting with http or https).

# error.onboarding.missingPassword
source: 请输入密码
en: Please enter password.

# error.onboarding.missingUsername
source: 请输入用户名
en: Please enter username.

# error.onboarding.unableResolveFavaURL
source: 无法解析 Fava 地址
en: Unable to resolve Fava URL.

# error.onboarding.unableSavePassword
source: 无法保存密码，请重试
en: Unable to save password. Please try again.

# error.viewModel.loadAccountDetail
source: 无法加载账户明细数据
en: Unable to load account detail data.

# error.viewModel.loadBalanceSheet
source: 无法加载资产负债表数据
en: Unable to load balance sheet data.

# error.viewModel.loadIncomeStatement
source: 无法加载损益表数据
en: Unable to load income statement data.

# error.viewModel.loadJournal
source: 无法加载日记账数据
en: Unable to load journal data.

# error.viewModel.loadJournalMore
source: 无法加载更多日记账数据
en: Unable to load more journal data.

# favaResolver.invalidResponse
source: 无法解析 Fava 地址，请检查服务器是否可访问
en: Unable to resolve Fava URL. Please check if the server is reachable.

# favaResolver.invalidURL
source: 请输入有效的 Fava 地址
en: Please enter a valid Fava URL.

# favaResolver.missingLedgerPath
source: 无法识别账本路径，请检查 Fava 首页是否可访问
en: Unable to identify ledger path. Please check if the Fava home page is reachable.

# favaResolver.requestFailed
source: 连接失败：%@
en: Connection failed: %@.

# incomeStatement.empty.title
source: 暂无损益表数据
en: No income statement data

# incomeStatement.expenses
source: 支出
en: Expenses

# incomeStatement.income
source: 收入
en: Income

# incomeStatement.netIncome
source: 净收入
en: Net Income

# journal.empty.title
source: 暂无日记账数据
en: No journal data

# journal.loadMore
source: 加载更多
en: Load more

# journal.search.prompt
source: 搜索交易
en: Search transactions

# journalDetail.amount
source: 金额
en: Amount

# journalDetail.date
source: 日期
en: Date

# journalDetail.description
source: 描述
en: Description

# journalDetail.flag
source: 标记
en: Flag

# journalDetail.kind
source: 类型
en: Type

# journalDetail.narration
source: 摘要
en: Narration

# journalDetail.noPostings
source: 暂无分录
en: No postings

# journalDetail.overview
source: 概览
en: Overview

# journalDetail.payee
source: 交易方
en: Payee

# journalDetail.postings
source: 分录
en: Postings

# journalDetail.status
source: 状态
en: Status

# journalKind.balance
source: 余额
en: Balance

# journalKind.note
source: 备注
en: Note

# journalKind.open
source: 开账
en: Open

# journalKind.other
source: 其他
en: Other

# journalKind.pad
source: 调整
en: Pad

# journalKind.price
source: 价格
en: Price

# journalKind.transaction
source: 交易
en: Transaction

# journalStatus.cleared
source: 已清算
en: Cleared

# journalStatus.other
source: 其他
en: Other

# journalStatus.pending
source: 待确认
en: Pending

# onboarding.action.save
source: 保存
en: Save

# onboarding.action.start
source: 开始使用
en: Get Started

# onboarding.favaAddress
source: Fava 地址
en: Fava URL

# onboarding.navTitle.favaConnection
source: Fava 连接
en: Fava Connection

# onboarding.password
source: 密码
en: Password

# onboarding.subtitle.onboarding
source: 请输入 Fava 地址以连接账本数据
en: Enter your Fava URL to connect your ledger

# onboarding.subtitle.settings
source: 更新 Fava 地址和登录信息
en: Update Fava URL and login information

# onboarding.title.onboarding
source: 欢迎使用 Counta
en: Welcome to Counta

# onboarding.title.settings
source: 连接 Fava
en: Connect Fava

# onboarding.toggle.basicAuth
source: 需要登录（Basic Auth）
en: Requires login (Basic Auth)

# onboarding.username
source: 用户名
en: Username

# settings.about.beancountWebsite
source: Beancount 官网
en: Beancount website

# settings.about.build
source: 构建
en: Build

# settings.about.tagline
source: 基于 Beancount 的财务管理
en: A Beancount-based finance manager

# settings.about.version
source: 版本
en: Version

# settings.row.aboutCounta
source: 关于 Counta
en: About Counta

# settings.row.currencyDisplay
source: 货币显示
en: Currency Display

# settings.row.currencyUncommonSymbolNote
source: 非常见货币将使用符号¤
en: Uncommon currencies will use ¤

# settings.row.favaServer
source: Fava 服务器
en: Fava Server

# settings.row.notSet
source: 未设置
en: Not set

# settings.section.about
source: 关于
en: About

# settings.section.connection
source: 连接
en: Connection

# settings.section.display
source: 显示
en: Display

# tab.balanceSheet
source: 资产负债
en: Balance Sheet

# tab.incomeStatement
source: 损益表
en: Income Statement

# tab.journal
source: 日记账
en: Journal

# tab.settings
source: 设置
en: Settings

# title.balanceSheet
source: 资产负债表
en: Balance Sheet

# title.incomeStatement
source: 损益表
en: Income Statement

# title.journal
source: 日记账
en: Journal

# title.settings
source: 设置
en: Settings
